Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2025DAB169.PIC
      <edc:SFRDef edc:_addr="0x1F810350" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="IPC33" edc:desc="" edc:impl="0xe0ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="IPC33" edc:nzwidth="32" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USBIS" edc:desc="" edc:mask="0x3" edc:name="USBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USBIP" edc:desc="" edc:mask="0x7" edc:name="USBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USBDMAIS" edc:desc="" edc:mask="0x3" edc:name="USBDMAIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USBDMAIP" edc:desc="" edc:mask="0x7" edc:name="USBDMAIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA0IS" edc:desc="" edc:mask="0x3" edc:name="DMA0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA0IP" edc:desc="" edc:mask="0x7" edc:name="DMA0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xe0ffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810360" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC34" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC34" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA2IS" edc:desc="" edc:mask="0x3" edc:name="DMA2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA2IP" edc:desc="" edc:mask="0x7" edc:name="DMA2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA3IS" edc:desc="" edc:mask="0x3" edc:name="DMA3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA3IP" edc:desc="" edc:mask="0x7" edc:name="DMA3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA4IS" edc:desc="" edc:mask="0x3" edc:name="DMA4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA4IP" edc:desc="" edc:mask="0x7" edc:name="DMA4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA5IS" edc:desc="" edc:mask="0x3" edc:name="DMA5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810370" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC35" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC35" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA6IS" edc:desc="" edc:mask="0x3" edc:name="DMA6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA6IP" edc:desc="" edc:mask="0x7" edc:name="DMA6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA7IS" edc:desc="" edc:mask="0x3" edc:name="DMA7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA7IP" edc:desc="" edc:mask="0x7" edc:name="DMA7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2EIS" edc:desc="" edc:mask="0x3" edc:name="SPI2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2EIP" edc:desc="" edc:mask="0x7" edc:name="SPI2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810380" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC36" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC36" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI2TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2EIS" edc:desc="" edc:mask="0x3" edc:name="U2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2EIP" edc:desc="" edc:mask="0x7" edc:name="U2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2RXIS" edc:desc="" edc:mask="0x3" edc:name="U2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2RXIP" edc:desc="" edc:mask="0x7" edc:name="U2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2TXIS" edc:desc="" edc:mask="0x3" edc:name="U2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2TXIP" edc:desc="" edc:mask="0x7" edc:name="U2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810390" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC37" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC37" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C2BIS" edc:desc="" edc:mask="0x3" edc:name="I2C2BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2BIP" edc:desc="" edc:mask="0x7" edc:name="I2C2BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2SIS" edc:desc="" edc:mask="0x3" edc:name="I2C2SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2SIP" edc:desc="" edc:mask="0x7" edc:name="I2C2SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2MIS" edc:desc="" edc:mask="0x3" edc:name="I2C2MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2MIP" edc:desc="" edc:mask="0x7" edc:name="I2C2MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CAN1IS" edc:desc="" edc:mask="0x3" edc:name="CAN1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN1IP" edc:desc="" edc:mask="0x7" edc:name="CAN1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103A0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC38" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC38" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAN2IS" edc:desc="" edc:mask="0x3" edc:name="CAN2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN2IP" edc:desc="" edc:mask="0x7" edc:name="CAN2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ETHIS" edc:desc="" edc:mask="0x3" edc:name="ETHIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ETHIP" edc:desc="" edc:mask="0x7" edc:name="ETHIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3EIS" edc:desc="" edc:mask="0x3" edc:name="SPI3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3EIP" edc:desc="" edc:mask="0x7" edc:name="SPI3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI3RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI3RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103B0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC39" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC39" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI3TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI3TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI3TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U3EIS" edc:desc="" edc:mask="0x3" edc:name="U3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3EIP" edc:desc="" edc:mask="0x7" edc:name="U3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U3RXIS" edc:desc="" edc:mask="0x3" edc:name="U3RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3RXIP" edc:desc="" edc:mask="0x7" edc:name="U3RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U3TXIS" edc:desc="" edc:mask="0x3" edc:name="U3TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U3TXIP" edc:desc="" edc:mask="0x7" edc:name="U3TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103C0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC40" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC40" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3BIS" edc:desc="" edc:mask="0x3" edc:name="I2C3BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3BIP" edc:desc="" edc:mask="0x7" edc:name="I2C3BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C3SIS" edc:desc="" edc:mask="0x3" edc:name="I2C3SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3SIP" edc:desc="" edc:mask="0x7" edc:name="I2C3SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C3MIS" edc:desc="" edc:mask="0x3" edc:name="I2C3MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3MIP" edc:desc="" edc:mask="0x7" edc:name="I2C3MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4EIS" edc:desc="" edc:mask="0x3" edc:name="SPI4EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4EIP" edc:desc="" edc:mask="0x7" edc:name="SPI4EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103D0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC41" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC41" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI4RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI4RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI4RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI4TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI4TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RTCCIS" edc:desc="" edc:mask="0x3" edc:name="RTCCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RTCCIP" edc:desc="" edc:mask="0x7" edc:name="RTCCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="FCEIS" edc:desc="" edc:mask="0x3" edc:name="FCEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="FCEIP" edc:desc="" edc:mask="0x7" edc:name="FCEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
