Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2025DAB169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA838" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA14" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA14" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL323" edc:desc="" edc:mask="0xf" edc:name="PIXEL323" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL322" edc:desc="" edc:mask="0xf" edc:name="PIXEL322" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL321" edc:desc="" edc:mask="0xf" edc:name="PIXEL321" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL320" edc:desc="" edc:mask="0xf" edc:name="PIXEL320" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL319" edc:desc="" edc:mask="0xf" edc:name="PIXEL319" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL318" edc:desc="" edc:mask="0xf" edc:name="PIXEL318" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL317" edc:desc="" edc:mask="0xf" edc:name="PIXEL317" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL316" edc:desc="" edc:mask="0xf" edc:name="PIXEL316" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA83C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA15" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA15" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL331" edc:desc="" edc:mask="0xf" edc:name="PIXEL331" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL330" edc:desc="" edc:mask="0xf" edc:name="PIXEL330" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL329" edc:desc="" edc:mask="0xf" edc:name="PIXEL329" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL328" edc:desc="" edc:mask="0xf" edc:name="PIXEL328" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL327" edc:desc="" edc:mask="0xf" edc:name="PIXEL327" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL326" edc:desc="" edc:mask="0xf" edc:name="PIXEL326" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL325" edc:desc="" edc:mask="0xf" edc:name="PIXEL325" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL324" edc:desc="" edc:mask="0xf" edc:name="PIXEL324" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA840" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA16" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA16" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL47" edc:desc="" edc:mask="0xf" edc:name="PIXEL47" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL46" edc:desc="" edc:mask="0xf" edc:name="PIXEL46" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL45" edc:desc="" edc:mask="0xf" edc:name="PIXEL45" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL44" edc:desc="" edc:mask="0xf" edc:name="PIXEL44" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL43" edc:desc="" edc:mask="0xf" edc:name="PIXEL43" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL42" edc:desc="" edc:mask="0xf" edc:name="PIXEL42" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL41" edc:desc="" edc:mask="0xf" edc:name="PIXEL41" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL40" edc:desc="" edc:mask="0xf" edc:name="PIXEL40" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA844" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA17" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA17" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL415" edc:desc="" edc:mask="0xf" edc:name="PIXEL415" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL414" edc:desc="" edc:mask="0xf" edc:name="PIXEL414" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL413" edc:desc="" edc:mask="0xf" edc:name="PIXEL413" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL412" edc:desc="" edc:mask="0xf" edc:name="PIXEL412" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL411" edc:desc="" edc:mask="0xf" edc:name="PIXEL411" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL410" edc:desc="" edc:mask="0xf" edc:name="PIXEL410" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL49" edc:desc="" edc:mask="0xf" edc:name="PIXEL49" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL48" edc:desc="" edc:mask="0xf" edc:name="PIXEL48" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA848" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA18" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA18" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL423" edc:desc="" edc:mask="0xf" edc:name="PIXEL423" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL422" edc:desc="" edc:mask="0xf" edc:name="PIXEL422" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL421" edc:desc="" edc:mask="0xf" edc:name="PIXEL421" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL420" edc:desc="" edc:mask="0xf" edc:name="PIXEL420" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL419" edc:desc="" edc:mask="0xf" edc:name="PIXEL419" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL418" edc:desc="" edc:mask="0xf" edc:name="PIXEL418" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL417" edc:desc="" edc:mask="0xf" edc:name="PIXEL417" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL416" edc:desc="" edc:mask="0xf" edc:name="PIXEL416" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA84C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA19" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA19" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL431" edc:desc="" edc:mask="0xf" edc:name="PIXEL431" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL430" edc:desc="" edc:mask="0xf" edc:name="PIXEL430" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL429" edc:desc="" edc:mask="0xf" edc:name="PIXEL429" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL428" edc:desc="" edc:mask="0xf" edc:name="PIXEL428" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL427" edc:desc="" edc:mask="0xf" edc:name="PIXEL427" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL426" edc:desc="" edc:mask="0xf" edc:name="PIXEL426" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL425" edc:desc="" edc:mask="0xf" edc:name="PIXEL425" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL424" edc:desc="" edc:mask="0xf" edc:name="PIXEL424" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA850" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA20" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA20" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL57" edc:desc="" edc:mask="0xf" edc:name="PIXEL57" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL56" edc:desc="" edc:mask="0xf" edc:name="PIXEL56" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL55" edc:desc="" edc:mask="0xf" edc:name="PIXEL55" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL54" edc:desc="" edc:mask="0xf" edc:name="PIXEL54" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL53" edc:desc="" edc:mask="0xf" edc:name="PIXEL53" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL52" edc:desc="" edc:mask="0xf" edc:name="PIXEL52" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL51" edc:desc="" edc:mask="0xf" edc:name="PIXEL51" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL50" edc:desc="" edc:mask="0xf" edc:name="PIXEL50" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA854" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA21" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA21" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL515" edc:desc="" edc:mask="0xf" edc:name="PIXEL515" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL514" edc:desc="" edc:mask="0xf" edc:name="PIXEL514" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL513" edc:desc="" edc:mask="0xf" edc:name="PIXEL513" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL512" edc:desc="" edc:mask="0xf" edc:name="PIXEL512" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL511" edc:desc="" edc:mask="0xf" edc:name="PIXEL511" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL510" edc:desc="" edc:mask="0xf" edc:name="PIXEL510" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL59" edc:desc="" edc:mask="0xf" edc:name="PIXEL59" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL58" edc:desc="" edc:mask="0xf" edc:name="PIXEL58" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
